# 作者: ZY
# @Time:2024/12/19 10:20
# way down we go
import pandas as pd
data = pd.read_excel("..\data\data_raw.xlsx")
features = [
    'ELBSL4-12570S机组系统_其他_L4机组电表_L4机组_Psum',
    'ELBSL4-12570S机组系统_L4冷凝设备组_01#水泵_蒸发冷水泵',
    'ELBSL4-12570S机组系统_L4冷凝设备组_01#风机_蒸发冷风机1',
    '1#冷冻库_05#风机_风机状态',
    'ELBSL4-12570S机组系统_L4-125S压缩机组_03#压缩机_压缩机3能级状态',
    'ELBSL4-12570S机组系统_L4-125S压缩机组_01#压缩机_压缩机1能级状态',
    '1#冷冻库_03#风机_风机状态',
    'ELBSL4-12570S机组系统_L4-125S压缩机组_02#压缩机_压缩机2能级状态',
]
data = data[features]
data.rename(columns={
"时间" :"time",
"ELBSL4-12570S机组系统_其他_L4机组电表_L4机组_Psum" :"P",
"ELBSL4-12570S机组系统_L4冷凝设备组_01#水泵_蒸发冷水泵" :"WP",
"ELBSL4-12570S机组系统_L4冷凝设备组_01#风机_蒸发冷风机1" :"WP1",
"1#冷冻库_05#风机_风机状态" :"FN5",
"ELBSL4-12570S机组系统_L4-125S压缩机组_03#压缩机_压缩机3能级状态" :"C3",
"ELBSL4-12570S机组系统_L4-125S压缩机组_01#压缩机_压缩机1能级状态" :"C1",
"1#冷冻库_03#风机_风机状态" :"FN3",
"ELBSL4-12570S机组系统_L4-125S压缩机组_02#压缩机_压缩机2能级状态" :"C2",
},inplace=True)
data.rename(columns={
"时间" :"time",
"冷冻库_冷冻1_温度设定下限" :"KL1",
"冷冻库_冷冻1_温度设定上限" :"KNL1",
"冷冻库_冷冻2_温度设定下限" :"KL2",
"冷冻库_冷冻2_温度设定上限" :"KNL2",
"冷冻库_冷冻3_温度设定下限" :"KL3",
"冷冻库_冷冻3_温度设定上限" :"KNL3",
"冷冻库2门1+门2+门3" :"D",
"环境温度" :"EN_T",
"机组功率" :"P",
},inplace=True)

